cf_billing/DataProcessors/энргТочкиУчетаМенеджер.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>энргТочкиУчетаМенеджер</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

cf_billing/Catalogs/энргТочкиУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>энргТочкиУчета</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УдалитьНазначение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргВидыЭнергоназначений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Головная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расположение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргМестаРасположенияТочекУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоТочкаПоставки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоТочкаПриема</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлинаТрубы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf_billing/DataProcessors/энргТочкиУчетаМенеджер/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Проверяет удалось ли заполнить объект по описанию.
//
// Параметры:
//  ОписаниеОбъекта	-	Структура	-	см. Обработка.энргТочкиУчетаМенеджер.ОписаниеОбъекта.
//  ЭтоНоваяСсылка	-	Булево.
// 
// Возвращаемое значение:
//   Булево.
//
Функция УдалосьЗаполнитьОбъектПоОписанию(ОписаниеОбъекта, ЭтоНоваяСсылка) Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		Если слжОбщегоНазначенияМодуль.ВоспроизводитьРезультатМетодов() Тогда; 
			Если НЕ Метаданные.Обработки.Найти("слжТочкиУчетаМенеджер") = Неопределено Тогда
				Возврат Обработки["слжТочкиУчетаМенеджер"].УдалосьЗаполнитьОбъектПоОписанию(ОписаниеОбъекта, ЭтоНоваяСсылка);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ЭлементСсылка 					= ОписаниеОбъекта.Ссылка;
	Результат 						= Справочники.энргТочкиУчета.УдалосьЗаполнитьОбъектПоОписанию(ЭлементСсылка, ОписаниеОбъекта, ЭтоНоваяСсылка);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		ИмяМетода 					= "энргТочкиУчетаМенеджер.УдалосьЗаполнитьОбъектПоОписанию";
		ПараметрыМетода 			= Новый Структура("ОписаниеОбъекта, ЭтоНоваяСсылка",ОписаниеОбъекта, ЭтоНоваяСсылка); 
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		слжОбщегоНазначенияМодуль.Логгер().ЗаписатьРезультат(ИмяМетода, Результат, ПараметрыМетода);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#Область ПолучениеЗначенийРеквизитов

// Получает значения реквизитов объектов.
//
// Параметры:
//  мТочкиУчета			-	Массив.
//  ПолучаемыеСвойства	-	Строка.
// 
// Возвращаемое значение:
//   Соответствие.
//
Функция ЗначенияРеквизитовОбъектов(мТочкиУчета,ПолучаемыеСвойства) Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		ИмяМетода 					= "энргТочкиУчетаМенеджер.ЗначенияСвойствОбъекта";
		ПараметрыМетода 			= Новый Структура("мТочкиУчета,ПолучаемыеСвойства", мТочкиУчета,ПолучаемыеСвойства);
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");		
	КонецЕсли;
	
	Результат 						= Справочники.энргТочкиУчета.ЗначенияРеквизитовОбъектов(мТочкиУчета,ПолучаемыеСвойства);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		ИмяМетода 					= "энргТочкиУчетаМенеджер.ЗначенияРеквизитовОбъектов";
		ПараметрыМетода 			= Новый Структура("мТочкиУчета, ПолучаемыеСвойства", мТочкиУчета, ПолучаемыеСвойства);
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		слжОбщегоНазначенияМодуль.Логгер().ЗаписатьРезультат(ИмяМетода, Результат, ПараметрыМетода);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Получает значения реквизитов объектов из строки JSON.
//
// Параметры:
//  ОписаниеТочки	-	Строка.
// 
// Возвращаемое значение:
//   Структура.
//
Функция ЗначенияРеквизитовОбъектовИзСтрокиJSON(ОписаниеТочки) Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		ИмяМетода 						= "энргТочкиУчетаМенеджер.ЗначенияРеквизитовОбъектовИзСтрокиJSON";
		ПараметрыМетода 				= Новый Структура("ОписаниеТочки", ОписаниеТочки);
		слжОбщегоНазначенияМодуль 		= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");		
	КонецЕсли;
	
	ДанныеТочки 						= Новый Структура("Головная,Расположение,Наименование",Ложь,Справочники.энргМестаРасположенияТочекУчета.ПустаяСсылка(),"");
	
	Если НЕ ПустаяСтрока(ОписаниеТочки) Тогда
		Чтение  						= Новый ЧтениеJSON;
		Чтение.УстановитьСтроку(ОписаниеТочки);		
		Описание						= ПрочитатьJSON(Чтение);
		
		Если  Описание.Свойство("Расположение") тогда
			Ключ 						= Новый УникальныйИдентификатор(Описание.Расположение);
			ДанныеТочки.Расположение 	= Справочники.энргМестаРасположенияТочекУчета.ПолучитьСсылку(Ключ);
		КонецЕсли;
		
		Если  Описание.Свойство("Наименование") тогда
			ДанныеТочки.Наименование	= Описание.Наименование;
		КонецЕсли;
		
		Если  Описание.Свойство("Головная") тогда
			ДанныеТочки.Головная 		= ДанныеТочки.Головная;
		КонецЕсли;		
	КонецЕсли;  		
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		ИмяМетода 						= "энргТочкиУчетаМенеджер.ЗначенияРеквизитовОбъектовИзСтрокиJSON";
		ПараметрыМетода 				= Новый Структура("ОписаниеТочки", ОписаниеТочки);
		слжОбщегоНазначенияМодуль 		= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		слжОбщегоНазначенияМодуль.Логгер().ЗаписатьРезультат(ИмяМетода, ДанныеТочки, ПараметрыМетода);
	КонецЕсли;
	
	Возврат ДанныеТочки;
	
КонецФункции

// Получает значения реквизитов объекта в виде строки JSON.
//
// Параметры:
//  ДанныеТочкиУчета	-	Структура.
// 
// Возвращаемое значение:
//   Строка.
//
Функция ЗначенияРеквизитовОбъектаВСтрокуJSON(ДанныеТочкиУчета) Экспорт
	Результат 								= "";
	ЕстьДанные  							= Ложь;
	Запись  								= Новый ЗаписьJSON;
	Запись.УстановитьСтроку();
	Запись.ЗаписатьНачалоОбъекта();
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеТочкиУчета,"Наименование") И ЗначениеЗаполнено(ДанныеТочкиУчета.Наименование) Тогда
		Запись.ЗаписатьИмяСвойства("Наименование");
		Запись.ЗаписатьЗначение(ДанныеТочкиУчета.Наименование);
		ЕстьДанные 							= Истина;
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеТочкиУчета,"Расположение") И ЗначениеЗаполнено(ДанныеТочкиУчета.Расположение) Тогда
		Запись.ЗаписатьИмяСвойства("Расположение");
		Запись.ЗаписатьЗначение("" + ДанныеТочкиУчета.Расположение.УникальныйИдентификатор());
		ЕстьДанные 							= Истина;
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеТочкиУчета,"Головная") Тогда
		Запись.ЗаписатьИмяСвойства("Головная");
		Запись.ЗаписатьЗначение(ДанныеТочкиУчета.Головная);
		ЕстьДанные 							= Истина;
	КонецЕсли;
	
	Запись.ЗаписатьКонецОбъекта();
	
	Если ЕстьДанные Тогда
		Результат 							= Запись.Закрыть();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
	
#КонецОбласти

// Получает описание объекта.
// 
// Возвращаемое значение:
//   Структура.
//
Функция ОписаниеОбъекта() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Расположение", 				Справочники.энргМестаРасположенияТочекУчета.ПустаяСсылка());
	Результат.Вставить("Наименование", 				"");
	Результат.Вставить("Головная", 					Ложь);
	Результат.Вставить("Ссылка", 					Справочники.энргТочкиУчета.ПустаяСсылка());
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
